"""
Задание 4.

Запросите у пользователя значения выручки и издержек фирмы.
Определите, с каким финансовым результатом работает фирма
(прибыль — выручка больше издержек, или убыток — издержки больше выручки).
Выведите соответствующее сообщение. Если фирма отработала с прибылью,
вычислите рентабельность выручки (соотношение прибыли к выручке).
Далее запросите численность сотрудников фирмы и определите
прибыль фирмы в расчете на одного сотрудника.

Пример:
Введите выручку фирмы: 1000
Введите издержки фирмы: 500
Финансовый результат - прибыль. Ее величина: 500
Значит вычисляем рентабельность выручки (соотношение прибыли к выручке)
Рентабельность выручки = 0.5
Введите численность сотрудников фирмы: 10
Прибыль фирмы в расчете на одного сотрудника = 50.0
"""

a = int(input("введите выручку за период: "))
b = int(input("введите издержки за период: "))
c = int(input("колличество сотрудников фирмы: " ))

if a > b:
    print("прибыль составила: ", a - b)
    print("Рентабельность выручки:", (a - b) / a, "; по", ((a - b) / c), "на одного сотрудника")
else:
    print("Этот период прибыли не принес!")
